package Level1.Exam1;
//Дано целое число.
// Если оно является положительным, то прибавить к не му 1;
// в противном случае не изменять его. Вывести полученное число.
public class Task06 {
    public static void main(String[] args) {
        int x=-5;
        if (x>0){
            x++;
        }
        System.out.println(x);
    }

}
