package Level1.lesson2.part1;

public class Variable2 {
    public static void main(String[] args) {
        /*Выбрать нужный тип данных и проинициализировать любым значением
        - возраст (подразумевается возраст человека);
        - пол (обозначать будем символами - мужской сокращаем до М, женский до Ж);
        - рост (измерять будем в метрах);
        - количество кирпичей для постройки дома (небольшой одноэтажный);
        - количество бактерий в йогурте (обычно изменяется в млн-ах)
                - расстояние до космических объектов (измерять будем в км);
        - разрешение на работу (рассматриваем всего 2 значения - или есть разрешение или его нет);
        - размер файла (измерять будем в байтах)*/
        byte age = 21;
        char gender = 'W';
        short growth = 180;
        int numberBricks = 1000;
        long bakterei = 100_000_000L;
        boolean hasjob = true;
        float fail = 100034537887743F;
        double kosmos = 12134354523.8;


    }
}
